# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2026-01-19 21:03:03 krylon>
#
#+TAGS: internals(i) ui(u) bug(b) feature(f)
#+TAGS: database(d) design(e), meditation(m)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* GuangNG [0/0]
  :PROPERTIES:
  :COOKIE_DATA: todo recursive
  :VISIBILITY: children
  :END:
** Clocktable
   #+BEGIN: clocktable :scope file :maxlevel 255 :emphasize t
   #+CAPTION: Clock summary at [2026-01-19 Mo 21:03]
   | Headline                                  | Time    |         |      |      |
   |-------------------------------------------+---------+---------+------+------|
   | *Total time*                              | *16:13* |         |      |      |
   |-------------------------------------------+---------+---------+------+------|
   | *GuangNG [0/0]*                           | *16:13* |         |      |      |
   | \_  /Components [0/0]/                    |         | /16:00/ |      |      |
   | \_    Main [0/0]                          |         |         | 0:15 |      |
   | \_    Model [0/0]                         |         |         | 1:32 |      |
   | \_    Database [0/0]                      |         |         | 2:09 |      |
   | \_    Blacklist [0/0]                     |         |         | 1:08 |      |
   | \_      Testing                           |         |         |      | 0:12 |
   | \_    Generator [2/2]                     |         |         | 9:28 |      |
   | \_      Sanity-check zones for XFR        |         |         |      | 0:47 |
   | \_    Nexus [0/0]                         |         |         | 1:28 |      |
   | \_  /Bugs [1/1]/                          |         | /0:13/  |      |      |
   | \_    Query XFRAdd did not return a value |         |         | 0:13 |      |
   #+END:
** Components [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY:
   :END:
*** Main [0/0]
    :LOGBOOK:
    CLOCK: [2026-01-19 Mo 19:25]--[2026-01-19 Mo 19:40] =>  0:15
    :END:
*** Model [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY:
    :END:
    :LOGBOOK:
    CLOCK: [2026-01-12 Mo 15:30]--[2026-01-12 Mo 15:32] =>  0:02
    CLOCK: [2026-01-11 So 16:51]--[2026-01-11 So 18:21] =>  1:30
    :END:
*** Database [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY:
    :END:
    :LOGBOOK:
    CLOCK: [2026-01-15 Do 21:10]--[2026-01-15 Do 21:15] =>  0:05
    CLOCK: [2026-01-15 Do 20:18]--[2026-01-15 Do 20:57] =>  0:39
    CLOCK: [2026-01-12 Mo 16:21]--[2026-01-12 Mo 16:58] =>  0:37
    CLOCK: [2026-01-12 Mo 15:32]--[2026-01-12 Mo 16:10] =>  0:38
    CLOCK: [2026-01-12 Mo 15:20]--[2026-01-12 Mo 15:30] =>  0:10
    :END:
*** Blacklist [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY:
    :END:
    :LOGBOOK:
    CLOCK: [2026-01-12 Mo 14:05]--[2026-01-12 Mo 15:01] =>  0:56
    :END:
**** Testing
     :LOGBOOK:
     CLOCK: [2026-01-12 Mo 15:06]--[2026-01-12 Mo 15:18] =>  0:12
     :END:
*** Generator [2/2]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY:
    :END:
    :LOGBOOK:
    CLOCK: [2026-01-16 Fr 16:59]--[2026-01-16 Fr 19:10] =>  2:11
    CLOCK: [2026-01-15 Do 21:15]--[2026-01-15 Do 21:35] =>  0:20
    CLOCK: [2026-01-15 Do 19:21]--[2026-01-15 Do 20:18] =>  0:57
    CLOCK: [2026-01-15 Do 17:26]--[2026-01-15 Do 18:57] =>  1:31
    CLOCK: [2026-01-14 Mi 19:17]--[2026-01-14 Mi 21:37] =>  2:20
    CLOCK: [2026-01-12 Mo 21:27]--[2026-01-12 Mo 22:49] =>  1:22
    :END:
**** DONE Unclutter log output
     CLOSED: [2026-01-19 Mo 20:58]
**** DONE Sanity-check zones for XFR
     CLOSED: [2026-01-19 Mo 20:58]
     :LOGBOOK:
     CLOCK: [2026-01-19 Mo 20:11]--[2026-01-19 Mo 20:58] =>  0:47
     :END:
     I have one example, of the "com." zone. We definitely don't want to query
     top-level domains, even if they let us do an AXFR. *Especially* if they
     let us, those must be humongous.
*** XFR [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY:
    :END:
*** Scanner [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY:
    :END:
*** Nexus [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY:
    :END:
    :LOGBOOK:
    CLOCK: [2026-01-19 Mo 18:47]--[2026-01-19 Mo 19:25] =>  0:38
    CLOCK: [2026-01-16 Fr 19:10]--[2026-01-16 Fr 20:00] =>  0:50
    :END:
*** Web UI [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY:
    :END:
** Features [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY:
   :END:
** Bugs [1/1]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY:
   :END:
*** DONE Query XFRAdd did not return a value
    CLOSED: [2026-01-19 Mo 20:00]
    :LOGBOOK:
    CLOCK: [2026-01-19 Mo 19:47]--[2026-01-19 Mo 20:00] =>  0:13
    :END:
    My first attempt at running the Generator gives the above error
    message. Let's see what's going on there.
    ...
    Turns out it was due to a badly written table constraint.
    I rewrote the constraint, the error message no longer appears. (For now.)
